Revit 2027 API
MEPAnalyticalModelData.GetNumberOfSegments Method
 Returns the number of analytical segments.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int GetNumberOfSegments()
Public Function GetNumberOfSegments As Integer
public:
int GetNumberOfSegments()
member GetNumberOfSegments : unit -> int
Return Value
Int32
 The total number of
See Also
Reference
MEPAnalyticalModelData Class
Autodesk.Revit.DB.Analysis Namespace